function x = Gauss_master3( A,b )
%列主元Gauss消去法计算三元线性方程组
%   Ax = b
if A(1,1)<A(2,1)
    temp = A(1,:);
    A(1,:) = A(2,:);
    A(2,:) = temp;
    temp = b(1);
    b(1) = b(2);
    b(2) = temp;
elseif A(1,1)<A(3,1)
    temp = A(1,:);
    A(1,:) = A(3,:);
    A(3,:) = temp;
    temp = b(1);
    b(1) = b(3);
    b(3) = temp;
end
b(2) = b(1)*(-A(2,1)/A(1,1)) + b(2)
A(2,:) = A(1,:)*(-A(2,1)/A(1,1)) + A(2,:)

b(3) = b(1)*(-A(3,1)/A(1,1)) + b(3)
A(3,:) = A(1,:)*(-A(3,1)/A(1,1)) + A(3,:)

if A(2,2)<A(3,2)
    temp = A(2,:);
    A(2,:) = A(3,:);
    A(3,:) = temp;
    temp = b(2);
    b(2) = b(3);
    b(3) = temp;
end
b(3) = b(2)*(-A(3,2)/A(2,2)) + b(3)
A(3,:) = A(2,:)*(-A(3,2)/A(2,2)) + A(3,:)

x(3) = b(3)/A(3,3);
x(2) = (b(2) - A(2,3)*x(3))/A(2,2);
x(1) = (b(1) - A(1,3)*x(3) - A(1,2)*x(2))/A(1,1);
end

